spec/vcr/SolidusAfterpay_Gateway_AdjustOrder/_capture/with_the_immediate_flow/with_an_amount_greater_than_the_original_order_total/returns_the_error_code_from_Afterpay_in_the_response.yml

---
http_interactions:
- request:
    method: post
    uri: https://global-api-sandbox.afterpay.com/v2/payments/capture
    body:
        encoding: UTF-8
      string: '{"token":"002.8lp05rmle32ja716duf55uugh5a9ftb25g771a6li8j2a3pe","merchantReference":null,"amount":{"amount":"100.0","currency":"USD"},"isCheckoutAdjusted":true,"paymentScheduleChecksum":null,"items":[{"name":"Product
        #1 - 1952","sku":"SKU-1","pageUrl":null,"imageUrl":null,"quantity":1,"price":{"amount":"10.0","currency":"USD"},"categories":[["87578"]],"estimatedShipmentDate":null,"preorder":false}],"shipping":{"name":"John
        Smith","line1":"A Different Road","line2":"Northwest","area1":"Herndon","area2":null,"region":"AL","postcode":"10002","countryCode":null,"phoneNumber":"555-555-0199"}}'
    headers:
      User-Agent:
      - SolidusAfterpay/0.2.0 (Solidus/2.10.3; Ruby/2.5.3; Merchant/100100040) https://
      Content-Type:
      - application/json
      Authorization:
      - "<Authorization Code>"
      Expect:
      - ''
  response:
    status:
      code: 412
      message: ''
    headers:
      Date:
      - Tue, 02 Nov 2021 17:01:32 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '148'
      Cf-Ray:
      - 6a7eecd28bc76f28-FCO
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      Cf-Cache-Status:
      - DYNAMIC
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Http-Correlation-Id:
      - bg3rw6atio7iwuzgzvyumuhlla
      X-Envoy-Upstream-Service-Time:
      - '3339'
      Set-Cookie:
      - __cf_bm=num5OEKT1t77hNq6EU5p9eZixyThEntloLQf7KNWjL8-1635872492-0-ASihWLS+k9wxkgwexlx3q2U0JH7e3S5hZTF11CZQqWwTOkgV6AgxFYA7dqcDKRl7G4YHwac+Bjx2Na+ZkJInEnrpDq/jpVMTNSInxWU+jKX7;
        path=/; expires=Tue, 02-Nov-21 17:31:32 GMT; domain=.afterpay.com; HttpOnly;
        Secure; SameSite=None
      Server:
      - cloudflare
    body:
      encoding: UTF-8
      string: |-
        {
          "errorCode" : "invalid_object",
          "errorId" : "ac965c14b9cf81cd",
          "message" : "Payment schedule checksum mismatch",
          "httpStatusCode" : 412
        }
    http_version:
  recorded_at: Tue, 02 Nov 2021 17:01:33 GMT
recorded_with: VCR 5.0.0
